OpenFOAM/foam9tutorials/CFD/sprayPlumeInteraction/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.003;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDi           0.25;

maxDeltaT       0.01;
/*
functions
{  
    fieldAverage
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        timeStart       0.5;
        timeEnd         2.0;
        outputControl   outputTime;
        fields
        (
            rho
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            T
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            O2
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            muSgs
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            alphaSgs
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            k
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
       );
   }
}
*/
// ************************************************************************* //
