OpenFOAM/foam9tutorials/CFD/sprayPlumeInteraction/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.012 -0.072 -0.012) //0
    (-0.012 -0.072 0.012) //1
    ( 0.012 -0.072 0.012) //2
    ( 0.012 -0.072 -0.012) //3

    (-0.02545 -0.072 -0.02545) //4
    (-0.02545 -0.072 0.02545) //5
    ( 0.02545 -0.072 0.02545) //6
    ( 0.02545 -0.072 -0.02545) //7

    (-0.127279 -0.072 -0.127279) //8
    (-0.127279 -0.072 0.127279) //9
    ( 0.127279 -0.072 0.127279) //10
    ( 0.127279 -0.072 -0.127279) //11

    (-0.353553 -0.072 -0.353553) //12
    (-0.353553 -0.072 0.353553) //13
    ( 0.353553 -0.072 0.353553) //14
    ( 0.353553 -0.072 -0.353553) //15

    (-0.012 0.0 -0.012) //16
    (-0.012 0.0 0.012) //17
    ( 0.012 -0.0 0.012) //18
    ( 0.012 -0.0 -0.012) //19

    (-0.02545 0.0 -0.02545) //20
    (-0.02545 0.0 0.02545) //21
    ( 0.02545 0.0 0.02545) //22
    ( 0.02545 0.0 -0.02545) //23

    (-0.127279 0.0 -0.127279) //24
    (-0.127279 0.0 0.127279) //25
    ( 0.127279 0.0 0.127279) //26
    ( 0.127279 0.0 -0.127279) //27

    (-0.353553 0.0 -0.353553) //28
    (-0.353553 0.0 0.353553) //29
    ( 0.353553 0.0 0.353553) //30
    ( 0.353553 0.0 -0.353553) //31

    (-0.012 0.59 -0.012) //32
    (-0.012 0.59 0.012) //33
    ( 0.012 0.59 0.012) //34
    ( 0.012 0.59 -0.012) //35

    (-0.02545 0.59 -0.02545) //36
    (-0.02545 0.59 0.02545) //37
    ( 0.02545 0.59 0.02545) //38
    ( 0.02545 0.59 -0.02545) //39

    (-0.127279 0.59 -0.127279) //40
    (-0.127279 0.59 0.127279) //41
    ( 0.127279 0.59 0.127279) //42
    ( 0.127279 0.59 -0.127279) //43

    (-0.353553 0.59 -0.353553) //44
    (-0.353553 0.59 0.353553) //45
    ( 0.353553 0.59 0.353553) //46
    ( 0.353553 0.59 -0.353553) //47

 );

blocks          
(

    hex (8 4 20 24 9 5 21 25) (24 12 4) simpleGrading (1 1 1) // W top-wall inner
    hex (5 6 22 21 9 10 26 25) (4 12 24) simpleGrading (1 1 1) // S top-wall inner
    hex (7 11 27 23 6 10 26 22) (24 12 4) simpleGrading (1 1 1) // E top-wall inner
    hex (8 11 27 24 4 7 23 20) (4 12 24) simpleGrading (1 1 1) // N top-wall inner

    hex (12 8 24 28 13 9 25 29) (52 12 4) simpleGrading (1 1 1) // W top-coflow inner
    hex (9 10 26 25 13 14 30 29) (4 12 52) simpleGrading (1 1 1) // S top-coflow inner
    hex (11 15 31 27 10 14 30 26) (52 12 4) simpleGrading (1 1 1) // E top-coflow inner
    hex (12 15 31 28 8 11 27 24) (4 12 52) simpleGrading (1 1 1) // N top-coflow inner



    hex (16 19 35 32 17 18 34 33) (4 98 4) simpleGrading (1 1 1) //square top-inlet //6mm

    hex (20 16 32 36 21 17 33 37) (4 98 4) simpleGrading (1 1 1) // W top-inlet inner
    hex (17 18 34 33 21 22 38 37) (4 98 4) simpleGrading (1 1 1) // S top-inlet inner
    hex (19 23 39 35 18 22 38 34) (4 98 4) simpleGrading (1 1 1) // E top-inlet inner
    hex (20 23 39 36 16 19 35 32) (4 98 4) simpleGrading (1 1 1) // N top-inlet inner

    hex (24 20 36 40 25 21 37 41) (24 98 4) simpleGrading (1 1 1) // W top-wall inner
    hex (21 22 38 37 25 26 42 41) (4 98 24) simpleGrading (1 1 1) // S top-wall inner
    hex (23 27 43 39 22 26 42 38) (24 98 4) simpleGrading (1 1 1) // E top-wall inner
    hex (24 27 43 40 20 23 39 36) (4 98 24) simpleGrading (1 1 1) // N top-wall inner

    hex (28 24 40 44 29 25 41 45) (52 98 4) simpleGrading (1 1 1) // W top-coflow inner
    hex (25 26 42 41 29 30 46 45) (4 98 52) simpleGrading (1 1 1) // S top-coflow inner
    hex (27 31 47 43 26 30 46 42) (52 98 4) simpleGrading (1 1 1) // E top-coflow inner
    hex (28 31 47 44 24 27 43 40) (4 98 52) simpleGrading (1 1 1) // N top-coflow inner

);

edges           
(

arc 4 5 (-0.036 -0.072 0.0)
arc 5 6 (0.0 -0.072 0.036)
arc 6 7 (0.036 -0.072 0.0)
arc 7 4 (0.0 -0.072 -0.036)

arc 20 21 (-0.036 0.0 0.0)
arc 21 22 (0.0 0.0 0.036)
arc 22 23 (0.036 0.0 0.0)
arc 23 20 (0.0 0.0 -0.036)


arc 8 9 (-0.18 -0.072 0.0)
arc 9 10 (0.0 -0.072 0.18)
arc 10 11 (0.18 -0.072 0.0)
arc 11 8 (0.0 -0.072 -0.18)

arc 24 25 (-0.18 0.0 0.0)
arc 25 26 (0.0 0.0 0.18)
arc 26 27 (0.18 0.0 0.0)
arc 27 24 (0.0 0.0 -0.18)


arc 36 37 (-0.036 0.59 0.0)
arc 37 38 (0.0 0.59 0.036)
arc 38 39 (0.036 0.59 0.0)
arc 39 36 (0.0 0.59 -0.036)


arc 12 13 (-0.5 -0.072 0.0)
arc 13 14 (0.0 -0.072 0.5)
arc 14 15 (0.5 -0.072 0.0)
arc 15 12 (0.0 -0.072 -0.5)

arc 28 29 (-0.5 0.0 0.0)
arc 29 30 (0.0 0.0 0.5)
arc 30 31 (0.5 0.0 0.0)
arc 31 28 (0.0 0.0 -0.5)

arc 40 41 (-0.18 0.59 0.0)
arc 41 42 (0.0 0.59 0.18)
arc 42 43 (0.18 0.59 0.0)
arc 43 40 (0.0 0.59 -0.18)

arc 44 45 (-0.5 0.59 0.0)
arc 45 46 (0.0 0.59 0.5)
arc 46 47 (0.5 0.59 0.0)
arc 47 44 (0.0 0.59 -0.5)

);

patches         
(

    patch inlet
    (
      (16 17 18 19)
      (20 21 17 16)
      (21 22 18 17)
      (22 23 19 18)
      (16 19 23 20)
    )

    wall inletWall 
    (
      (4 5 21 20)
      (5 6 22 21)
      (6 7 23 22)
      (7 4 20 23)
    )

    patch coflow
    (
      (8 9 5 4)
      (9 10 6 5)
      (10 11 7 6)
      (4 7 11 8)

      (12 8 9 13)
      (9 10 14 13)
      (10 11 15 14)
      (11 8 12 15)
    )

    patch sides 
    (
      (12 13 29 28)
      (13 14 30 29)
      (14 15 31 30)
      (15 12 28 31)    

      (28 29 45 44)
      (29 30 46 45)
      (30 31 47 46)
      (31 28 44 47)  
    )

    wall plate
    (
      (32 33 34 35)

      (36 37 33 32)
      (37 38 34 33)
      (38 39 35 34)
      (32 35 39 36)

      (40 41 37 36)
      (41 42 38 37)
      (42 43 39 38)
      (36 39 43 40)

      (44 45 41 40)
      (45 46 42 41)
      (46 47 43 42)
      (40 43 47 44)
    )

);

mergePatchPairs
(  
    
);

// ************************************************************************* //
