OpenFOAM/foam9tutorials/CFD/sprayPlumeInteraction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type             turbulentInlet;
        fluctuationScale (0.02 0.02 0.02);
        referenceField   uniform (0 5.3 0);
        value            uniform (0 5.3 0); //2.6 kW
    }

    inletWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    coflow
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           uniform ( 0 0 0 );
    }

    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    plate
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}
